#include <iostream>
using namespace std;
/*
https://euler.stephan-brumme.com/
Задача 12
Треугольное число с большим количеством делителей
(Треугольное число — это число точек, которые могут быть расставлены в форме
правильного треугольника (см. рисунок). Очевидно, с чисто арифметической
точки зрения, n-е треугольное число — это сумма n первых натуральных чисел)

Последовательность треугольных чисел образуется путем сложения натуральных
чисел.К примеру, 7-ое треугольное число равно 1 + 2 + 3 + 4 + 5 + 6 + 7 = 28.
Первые десять треугольных чисел:

1, 3, 6, 10, 15, 21, 28, 36, 45, 55, ...

Перечислим делители первых семи треугольных чисел:

 1: 1
 3: 1, 3
 6: 1, 2, 3, 6
10: 1, 2, 5, 10
15: 1, 3, 5, 15
21: 1, 3, 7, 21
28: 1, 2, 4, 7, 14, 28
Как мы видим, 28 - первое треугольное число, у которого более пяти делителей.

Каково первое треугольное число, у которого более пятисот делителей?

The sequence of triangle numbers is generated by adding the natural numbers.
So the 7th triangle number would be 1 + 2 + 3 + 4 + 5 + 6 + 7 = 28.
The first ten terms would be:

1, 3, 6, 10, 15, 21, 28, 36, 45, 55, ...

Let us list the factors of the first seven triangle numbers:

 1: 1
 3: 1,3
 6: 1,2,3,6
10: 1,2,5,10
15: 1,3,5,15
21: 1,3,7,21
28: 1,2,4,7,14,28
We can see that 28 is the first triangle number to have over five divisors.

What is the value of the first triangle number to have over five hundred
divisors?
*/
int max_divisors = 150;

void eiler12(){
    int limit = 0;
    unsigned long start = 1;
    unsigned long step = 2;
    while (limit < max_divisors){
        limit = 1;
        for (int i = 1; i < start; i++){
            if (start % i == 0) limit += 1;
        }
        start += step;
        step += 1;
    }
    start = start - step + 1;
    cout << "#12. Result = " << start << " have " << limit << " divisors" << endl;
    //#12. Result = 749700 have 162 divisors
    //Process returned 0 (0x0)   execution time : 0.817 s
}
