#include <iostream>
using namespace std;
/*
https://euler.stephan-brumme.com/
Задача 2
Четные числа Фибоначчи

Каждый следующий элемент ряда Фибоначчи получается при сложении двух
предыдущих. Начиная с 1 и 2, первые 10 элементов будут:

1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

Найдите сумму всех четных элементов ряда Фибоначчи, которые не превышают
четыре миллиона

Each new term in the Fibonacci sequence is generated by adding the previous
two terms. By starting with 1 and 2, the first 10 terms will be:

1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

By considering the terms in the Fibonacci sequence whose values do not exceed
four million, find the sum of the even-valued terms.
*/

void eiler2(){
    int limit2 = 4000000;
    int sum = 0;
    int fib_num = 0;
    int prev = 0;
    int next = 1;
    while (fib_num <= limit2){
        //cout << fib_num << " ";
        fib_num = prev + next;
        prev = next;
        next = fib_num;
        if (fib_num % 2 == 0) sum += fib_num;
    }
    cout << "#2. Sum = " << sum << endl;
    //#2. Sum = 4613732
}
